Revit 2027 API
BuiltInFailures.AssemblyFailures.NoEligibleElementsInAssembly Property
 No eligible elements in assembly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoEligibleElementsInAssembly { get; }
Public Shared ReadOnly Property NoEligibleElementsInAssembly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoEligibleElementsInAssembly {
	FailureDefinitionId^ get ();
}
static member NoEligibleElementsInAssembly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace